CSI API ETABS v1

# cPropFrameGetMaterial Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetMaterial(
    	string Name,
    	ref string MatProp
    )

    Function GetMaterial (
    	Name As String,
    	ByRef MatProp As String
    ) As Integer

    Dim instance As cPropFrame
    Dim Name As String
    Dim MatProp As String
    Dim returnValue As Integer

    returnValue = instance.GetMaterial(Name,
    	MatProp)

    int GetMaterial(
    	String^ Name,
    	String^% MatProp
    )

    abstract GetMaterial :
            Name : string *
            MatProp : string byref -> int

#### Parameters

Name

    Type: SystemString

MatProp

    Type: SystemString

#### Return Value

Type: Int32

See Also

#### Reference

cPropFrame Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com